base/system/blockMeshDict
// Generated by Chase Holder 

// D = 1.00
// L = 15.00



FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    ( 0.00000000  0.00000000  0.05) // 0 
    ( 15.00000000  0.00000000  0.05) // 1 
    ( 15.00000000  0.50000000  0.05) // 2 
    ( 0.00000000  0.50000000  0.05) // 3 
    ( 15.00000000 -0.50000000  0.05) // 4 
    ( 0.00000000 -0.50000000  0.05) // 5 
    ( 0.00000000  0.00000000  -0.05) // 6 
    ( 15.00000000  0.00000000  -0.05) // 7 
    ( 15.00000000  0.50000000  -0.05) // 8 
    ( 0.00000000  0.50000000  -0.05) // 9 
    ( 15.00000000 -0.50000000  -0.05) // 10 
    ( 0.00000000 -0.50000000  -0.05) // 11 
);

blocks
(
   // block 0
   hex (6 7 8 9 0 1 2 3) (150 5 1) simpleGrading (1.0 1.0 1.0)

   // block 1
   hex (0 1 4 5 6 7 10 11) (150 5 1) simpleGrading (1.0 1.0 1.0)

);

boundary
(

   inlet
   {
      type patch;
      faces
      (
         (0 6 9 3)
         (0 6 11 5)
      );
   }

   outlet
   {
      type patch;
      faces
      (
         (1 7 8 2)
         (1 7 10 4)
      );
   }

   top
   {
      type wall;
      faces
      (
         (3 2 8 9)
      );
   }

   bottom
   {
      type wall;
      faces
      (
         (4 5 11 10)
      );
   }

);